import React from "react";
import styles from "../../styles/Home.module.css";
import ProductCard from "../../components/MyGallery";
import Layout from "../../components/Layout";
import Paper from "@mui/material/Paper";

const index = () => {
  return (
    <div className={styles.container}>
      <Layout>
        <main className={styles.main}>
          <div className={styles.grid}>
            <div
              style={{
                display: "flex",
                flexWrap: "wrap",
                alignItems: "center",
                justifyContent: "center",
              }}
            >
              <ProductCard />
            </div>
          </div>
          <Paper
            elevation={3}
            sx={{
              width: "81%",
              backgroundColor: "transparent",
              padding: "30px",
              marginTop: "1.5rem",
              borderRadius: "10px",
              variant: "fullWidth",
            }}
          >
            <article>
              <p>
                Пам'ятники з граніту - це незабутні символи вічної пам'яті, які
                створюються з міцного та витривалого природного каменю. Граніт є
                одним з найбільш популярних матеріалів для пам'ятників завдяки
                його міцності, стійкості до погодних умов та довговічності. У
                створенні пам'ятника з граніту важливо розглянути кілька
                аспектів, таких як дизайн, розмір, форму та колір.
              </p>
              <p>
                Дизайн пам'ятника має відображати особистість, яку він вшановує.
                Він може бути виконаний в різних стилях, включаючи класичний,
                сучасний та абстрактний. Для відтворення зображень та написів на
                поверхні пам'ятника зазвичай використовують різьблення,
                гравіювання або барельєфи.
              </p>
              <p>
                Розмір та форма пам'ятника також мають велике значення. Вони
                можуть варіюватись від невеликих та компактних до високих та
                масивних. Важливо забезпечити безпеку та видимість пам'ятника в
                залежності від його розташування.
              </p>
              <p>
                Пам'ятники з граніту можуть мати різні цілі та призначення. Вони
                можуть бути встановлені в пам'ять про померлих, вшанування
                видатних особистостей, як символ певної події або як частина
                архітектурного ансамблю.
              </p>
              <p>
                Оскільки граніт є дуже міцним матеріалом, пам'ятники з нього
                можуть служити вічним свідченням про події та людей, яких ми
                хочемо вшанувати. Вони можуть бути встановлені як у відкритих
                просторах, так і в закритих приміщеннях, що робить їх
                універсальними та доступними для всіх бажаючих.
              </p>
            </article>
          </Paper>
        </main>
      </Layout>
    </div>
  );
};

export default index;
